export const AboutUs = () => {
  return (
    <section
      id="about"
      className="flex flex-col items-center max-w-[85%] mx-[auto] mt-[100px] max-lg:max-w-[90%] max-md:mt-[70px] max-sm:mt-[50px]"
    >
      <h1 className="text-text-general text-[40px] font-semibold text-center max-sm:text-[30px] font-poppins">
        Про нас
      </h1>
      <div className="flex flex-col gap-[8px] text-text-second mt-[25px] text-[18px] w-[75%] text-justify max-lg:w-[100%] font-manrope">
        <p>
          Flora Komarno є найкращим місцем для придбання чудових квітів у
          Комарно та околицях. У Flora Komarno ми віримо, що квіти – це більше
          ніж просто рослини. Це вираження емоцій, любові та найважливіших
          моментів життя.
        </p>
        <p>
          Наша місія проста: приносити красу і радість у кожну подію завдяки
          нашим вишуканим квітковим композиціям. Незалежно від того, чи це
          весілля, день народження, річниця чи просто день, який ви хочете
          зробити особливим, наші ретельно підібрані квіти покликані підняти ваш
          настрій і створити незабутні враження.
        </p>
        <p>
          Flora Komarno була заснована з пристрастю до квітів і відданістю
          задоволенню клієнтів. Наша подорож почалася з маленького магазину в
          центрі Комарно, де ми створювали персоналізовані букети та композиції.
        </p>
        <p>
          Ми пишаємося тим, що пропонуємо широкий вибір свіжих, високоякісних
          квітів. Від класичних троянд до екзотичних орхідей та сезонних квітів,
          наша колекція створена для задоволення будь-яких смаків і потреб.
        </p>
      </div>
    </section>
  );
};
